tutorials4HD/porousHemodynamic4HD/middleCerebralArtery/constant/hematocritProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      haemoTransportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
a                   a                   [ 0 1 0 0 0 0 0 ]   3.5e-6;
Kc                  Kc                  [ 0 0 0 0 0 0 0 ]   0.31;
Kmu                 Kmu                 [ 0 0 0 0 0 0 0 ]   0.62;
haemoSwitch         haemoSwitch         [ 0 0 0 0 0 0 0 ]   1;// switch haematocrit migration model on or off, 0: off, 1: on
haemoSwitchTime     haemoSwitchTime     [ 0 0 1 0 0 0 0 ]   0.0;// run without haematocrit migration model for first N timesteps
linKc               linKc               [ 0 0 0 0 0 0 0 ]   1;
nonlinKc            nonLinKc            [ 0 0 0 0 0 0 0 ]   0;
nonlinKcRatio       nonLinKcRatio       [ 0 0 0 0 0 0 0 ]   1.40;
